package com.example.playvideota.fragment;

import android.os.Bundle;

import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.example.playvideota.R;
import com.example.playvideota.adapter.GeetaAdapter;
import com.example.playvideota.adapter.TvLiveVideoAdapter;
import com.example.playvideota.databinding.FragmentGeetaSlokBinding;
import com.example.playvideota.databinding.FragmentRashiphalBinding;
import com.example.playvideota.model.GeetaModel;

import java.util.ArrayList;


public class GeetaSlokFragment extends Fragment {

    RecyclerView geetaRv;
    FragmentGeetaSlokBinding binding;
    ArrayList<GeetaModel> list1 = new ArrayList<>();
    ArrayList<GeetaModel> list2 = new ArrayList<>();
    ArrayList<GeetaModel> list3 = new ArrayList<>();
    ArrayList<GeetaModel> list4 = new ArrayList<>();
    ArrayList<GeetaModel> list5 = new ArrayList<>();
    ArrayList<GeetaModel> list6 = new ArrayList<>();
    ArrayList<GeetaModel> list7 = new ArrayList<>();
    ArrayList<GeetaModel> list8 = new ArrayList<>();
    ArrayList<GeetaModel> list9 = new ArrayList<>();
    ArrayList<GeetaModel> list10 = new ArrayList<>();
    ArrayList<GeetaModel> list11 = new ArrayList<>();
    ArrayList<GeetaModel> list12 = new ArrayList<>();
    ArrayList<GeetaModel> list13 = new ArrayList<>();
    ArrayList<GeetaModel> list14 = new ArrayList<>();
    ArrayList<GeetaModel> list15 = new ArrayList<>();
    ArrayList<GeetaModel> list16 = new ArrayList<>();
    ArrayList<GeetaModel> list17 = new ArrayList<>();
    ArrayList<GeetaModel> list18 = new ArrayList<>();

    public GeetaSlokFragment() {
        // Required empty public constructor
    }


    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
//        return inflater.inflate(R.layout.fragment_geeta_slok, container, false);

        binding = FragmentGeetaSlokBinding.inflate(inflater,container,false);

        list1.add(new GeetaModel("Adhya 1","Geeta Slok 1","धृतराष्ट्र उवाच |\n" +
                "धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः |\n" +
                "मामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय ||1||","धृतराष्ट्र ने कहा: हे संजय, कुरुक्षेत्र के पवित्र मैदान पर एकत्रित होकर, और युद्ध करने की इच्छा रखने के बाद, मेरे पुत्रों और पांडु के पुत्रों ने क्या किया?"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 2","सञ्जय उवाच ।\n" +
                "दृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा ।\n" +
                "आचार्यमुपसङ्गम्य राजा वचनमब्रवीत् ।। 2।।","संजय ने कहा: पांडव सेना को सैन्य सेना में खड़ा देखकर, राजा दुर्योधन अपने शिक्षक द्रोणाचार्य के पास पहुंचे, और निम्नलिखित शब्द कहे।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 3","पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम् ।\n" +
                "व्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता ।। 3।।","दुर्योधन ने कहा- आदरणीय गुरु! पांडु के पुत्रों की शक्तिशाली सेना को देखो, जो द्रुपद के पुत्र, अपने ही प्रतिभाशाली शिष्य द्वारा युद्ध के लिए इतनी कुशलता से तैयार है।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 4-6","अत्र शूरा महेष्वासा भीमार्जुनसमा युधि\n" +
                "युयुधानो विराटश्च द्रुपदश्च महारथ: || 4||\n" +
                "\n" +
                "धृष्टकेतुश्चेकितान: काशिराजश्च वीर्यवान् |\n" +
                "पुरुजित्कुन्तिभोजश्च शैब्यश्च नरपुङ्गव: || 5||\n" +
                "\n" +
                "युधामन्युश्च विक्रान्त उत्तमौजाश्च वीर्यवान् |\n" +
                "सौभद्रो द्रौपदेयाश्च सर्व एव महारथा: || 6||","देखो उनके रैंकों में युयुधन, विराट और द्रुपद जैसे कई शक्तिशाली योद्धा हैं, जो शक्तिशाली धनुष का सामना कर रहे हैं और भीम और अर्जुन के बराबर सैन्य कौशल में हैं। धृष्टकेतु, चेकितान, काशी के वीर राजा पुरुजीत, कुंतीभोज और शैब्य जैसे निपुण नायक भी हैं। उनके रैंकों में, उनके पास साहसी युद्धमन्यु, सुभद्रा के पुत्र, बहादुर उत्तमौजा और द्रौपदी के पुत्र भी हैं, जो सभी महान योद्धा प्रमुख हैं।"));


        list1.add(new GeetaModel("Adhya 1","Geeta Slok 7","अस्माकं तु विशिष्टा ये तान्निबोध द्विजोत्तम |\n" +
                "नायका मम सैन्यस्य संज्ञार्थं तान्ब्रवीमि ते || 7||","हे श्रेष्ठ ब्राह्मणों, हमारी ओर के प्रमुख सेनापतियों के बारे में भी सुनो, जो विशेष रूप से नेतृत्व करने के योग्य हैं। अब मैं आपको बताता हूं"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 8","भवान्भीष्मश्च कर्णश्च कृपश्च समितिञ्जय: |\n" +
                "अश्वत्थामा विकर्णश्च सौमदत्तिस्तथैव च || 8||","आपके, भीष्म, कर्ण, कृपा, अश्वत्थामा, विकर्ण और भूरिश्रवा जैसे व्यक्तित्व हैं, जो युद्ध में हमेशा विजयी होते हैं।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 9","अन्ये च बहव: शूरा मदर्थे त्यक्तजीविता: |\n" +
                "\n" +
                "नानाशस्त्रप्रहरणा: सर्वे युद्धविशारदा: || 9||","इसके अलावा, कई अन्य वीर योद्धा हैं, जो मेरे लिए अपना जीवन देने के लिए तैयार हैं। वे सभी युद्ध की कला में कुशल हैं, और विभिन्न प्रकार के हथियारों से लैस हैं"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 10","अपर्याप्तं तदस्माकं बलं भीष्माभिरक्षितम् |\n" +
                "\n" +
                "पर्याप्तं त्विदमेतेषां बलं भीमाभिरक्षितम् || 10||","हमारी सेना की ताकत असीमित है और हमें ग्रैंडसियर भीष्म द्वारा सुरक्षित रूप से मार्शल किया जाता है, जबकि पांडव सेना की ताकत, जिसे भीम द्वारा सावधानीपूर्वक मार्शल किया गया था, सीमित है।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 11","अयनेषु च सर्वेषु यथाभागमवस्थिता: |\n" +
                "भीष्ममेवाभिरक्षन्तु भवन्त: सर्व एव हि || 11||","इसलिए, मैं कौरव सेना के सभी जनरलों का आह्वान करता हूं कि वे ग्रैंडसिर भीष्म को पूरा समर्थन दें, भले ही आप अपने संबंधित रणनीतिक बिंदुओं का बचाव करें।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 12","तस्य सञ्जनयन्हर्षं कुरुवृद्ध: पितामह: |\n" +
                "सिंहनादं विनद्योच्चै: शङ्खं दध्मौ प्रतापवान् || 12||","फिर, कुरु वंश के दादाजी, प्रतापी कुलपिता भीष्म, शेर की तरह दहाड़े, और दुर्योधन को खुशी देते हुए अपने शंख को बहुत जोर से उड़ाया।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 13","तत: शङ्खाश्च भेर्यश्च पणवानकगोमुखा: |\n" +
                "सहसैवाभ्यहन्यन्त स शब्दस्तुमुलोऽभवत् || 13||","इसके बाद, शंख, केटलड्रम, बिगुल, तुरही और सींग अचानक तेज हो गए, और उनकी संयुक्त ध्वनि भारी थी।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 14","तत: श्वेतैर्हयैर्युक्ते महति स्यन्दने स्थितौ |\n" +
                "माधव: पाण्डवश्चैव दिव्यौ शङ्खौ प्रदध्मतु: || 14||","फिर, पांडव सेना के बीच से, सफेद घोड़ों द्वारा खींचे गए एक शानदार रथ में बैठे, माधव और अर्जुन ने अपने दिव्य शंख बजाए।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 15","पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जय: |\n" +
                "पौण्ड्रं दध्मौ महाशङ्खं भीमकर्मा वृकोदर: || 15||","हृषिकेश ने अपना शंख बजाया, जिसे पांचजन्य कहा जाता है, और अर्जुन ने देवदत्त उड़ाया। भीम, जो खाने वाला और कठिन कार्यों का प्रदर्शन करने वाला था, ने अपने शक्तिशाली शंख को उड़ाया, जिसे पौंड्रा कहा जाता है।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 16-18","अनन्तविजयं राजा कुन्तीपुत्रो युधिष्ठिर: |\n" +
                "नकुल: सहदेवश्च सुघोषमणिपुष्पकौ || 16||\n" +
                "काश्यश्च परमेष्वास: शिखण्डी च महारथ: |\n" +
                "धृष्टद्युम्नो विराटश्च सात्यकिश्चापराजित: || 17||\n" +
                "द्रुपदो द्रौपदेयाश्च सर्वश: पृथिवीपते |\n" +
                "सौभद्रश्च महाबाहु: शङ्खान्दध्मु: पृथक् पृथक् || 18||","राजा युधिष्ठिर ने अनंतविजय उड़ाया, जबकि नकुल और सहदेव ने सुघोष और मणिपुष्पक उड़ाया। उत्कृष्ट धनुर्धर और काशी के राजा, महान योद्धा शिखंडी, धृष्टद्युम्न, विराट और अजेय सात्यकि द्रौपदी के पांच पुत्र द्रुपद और सुभद्रा के पुत्र पराक्रमी-शस्त्र अभिमन्यु सभी ने अपने-अपने शंख उड़ाए, हे पृथ्वी के शासक।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 19","स घोषो धार्तराष्ट्राणां हृदयानि व्यदारयत् |\n" +
                "\n" +
                "नभश्च पृथिवीं चैव तुमुलोऽभ्यनुनादयन् || 19||","आकाश और पृथ्वी पर भयानक ध्वनि गरजी, और आपके बेटों के दिलों को चकनाचूर कर दिया, हे धृतराष्ट्र"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 20","अथ व्यवस्थितान्दृष्ट्वा धार्तराष्ट्रान् कपिध्वज: |\n" +
                "प्रवृत्ते शस्त्रसम्पाते धनुरुद्यम्य पाण्डव: ||20||\n" +
                "हृषीकेशं तदा वाक्यमिदमाह महीपते |","उस समय पांडु के पुत्र अर्जुन, जिनके रथ के ध्वज पर हनुमान का प्रतीक चिन्ह था, ने अपना धनुष उठाया। हे राजा, अर्जुन ने अपने पुत्रों को अपने विरुद्ध खड़ा देखकर श्री कृष्ण से निम्नलिखित शब्द कहे।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 21-22","अर्जुन उवाच |\n" +
                "सेनयोरुभयोर्मध्ये रथं स्थापय मेऽच्युत || 21||\n" +
                "यावदेतान्निरीक्षेऽहं योद्धुकामानवस्थितान् |\n" +
                "कैर्मया सह योद्धव्यमस्मिन् रणसमुद्यमे || 22||","अर्जुन ने कहा: हे अचूक, कृपया मेरे रथ को दोनों सेनाओं के बीच में ले जाएं, ताकि मैं युद्ध के लिए तैयार योद्धाओं को देख सकूं, जिनसे मुझे इस महान युद्ध में लड़ना है।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 23","योत्स्यमानानवेक्षेऽहं य एतेऽत्र समागता: |\n" +
                "धार्तराष्ट्रस्य दुर्बुद्धेर्युद्धे प्रियचिकीर्षव: || 23||","मैं उन लोगों को देखना चाहता हूं जो धृतराष्ट्र के दुष्ट स्वभाव वाले पुत्र के पक्ष में लड़ने के लिए यहां आए हैं, उसे खुश करने की इच्छा रखते हैं।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 24","एवमुक्तो हृषीकेशो गुडाकेशेन भारत |\n" +
                "सेनयोरुभयोर्मध्ये स्थापयित्वा रथोत्तमम् || 24||","संजय ने कहा: हे धृतराष्ट्र, जिसे इस प्रकार अर्जुन, नींद के विजेता द्वारा संबोधित किया गया था, श्री कृष्ण ने तब दोनों सेनाओं के बीच शानदार रथ खींचा।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 25","भीष्मद्रोणप्रमुखत: सर्वेषां च महीक्षिताम् |\n" +
                "उवाच पार्थ पश्यैतान्समवेतान्कुरूनिति || 25||","भीष्म, द्रोणाचार्य और अन्य सभी राजाओं की उपस्थिति में श्री कृष्ण ने कहा: हे पार्थ, इन कुरुओं को देखो।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 26","तत्रापश्यत्स्थितान् पार्थ: पितृ नथ पितामहान् |\n" +
                "आचार्यान्मातुलान्भ्रातृ न्पुत्रान्पौत्रान्सखींस्तथा || 26||\n" +
                "श्वशुरान्सुहृदश्चैव सेनयोरुभयोरपि |","वहां, अर्जुन दोनों सेनाओं में तैनात, अपने पिता, दादा, शिक्षक, मामा, भाई, चचेरे भाई, बेटे, भतीजे, पोते-भतीजे, दोस्त, ससुर और शुभचिंतकों को देख सकते थे।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 27","तान्समीक्ष्य स कौन्तेय: सर्वान्बन्धूनवस्थितान् || 27||\n" +
                "कृपया परयाविष्टो विषीदन्निदमब्रवीत् |","वहां उपस्थित अपने सभी रिश्तेदारों को देख कुंती के पुत्र अर्जुन करुणा से अभिभूत हो गए, और गहरे दुःख के साथ निम्नलिखित शब्द बोले।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 28","अर्जुन उवाच |\n" +
                "दृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम् || 28||\n" +
                "सीदन्ति मम गात्राणि मुखं च परिशुष्यति |","अर्जुन ने कहा: हे कृष्ण, अपने ही रिश्तेदारों को यहां युद्ध के लिए खड़ा देखकर और एक-दूसरे को मारने का इरादा रखते हुए, मेरे अंग रास्ता दे रहे हैं और मेरा मुंह सूख रहा है।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 29-31","वेपथुश्च शरीरे मे रोमहर्षश्च जायते || 29||\n" +
                "गाण्डीवं स्रंसते हस्तात्त्वक्चै व परिदह्यते |\n" +
                "न च शक्नोम्यवस्थातुं भ्रमतीव च मे मन: || 30||\n" +
                "निमित्तानि च पश्यामि विपरीतानि केशव |\n" +
                "न च श्रेयोऽनुपश्यामि हत्वा स्वजनमाहवे || 31||","मेरा पूरा शरीर कांप जाता है; मेरे रोंगटे खड़े हैं। मेरा धनुष, ग़वी, मेरे हाथ से फिसल रहा है, और मेरी त्वचा चारों ओर जल रही है। मेरा मन उलझन में है और भ्रम में भंवर में है; मैं अब खुद को स्थिर रखने में असमर्थ हूं। हे कृष्ण, केशी राक्षस के हत्यारे, मुझे दुर्भाग्य के शगुन ही दिखाई देते हैं। मुझे नहीं लगता कि इस लड़ाई में अपने ही रिश्तेदारों को मारने से कोई फायदा कैसे हो सकता है।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 32-33","न काङ्क्षे विजयं कृष्ण न च राज्यं सुखानि च |\n" +
                "किं नो राज्येन गोविन्द किं भोगैर्जीवितेन वा || 32||\n" +
                "येषामर्थे काङ्क्षितं नो राज्यं भोगा: सुखानि च |\n" +
                "त इमेऽवस्थिता युद्धे प्राणांस्त्यक्त्वा धनानि च || 33||","हे कृष्ण, मैं विजय, राज्य या उससे प्राप्त होने वाली खुशी नहीं चाहता। एक राज्य, सुख, या यहां तक कि जीवन का क्या फायदा होगा, जब वे लोग जिनके लिए हम उनका लालच करते हैं, युद्ध के लिए हमारे सामने खड़े हैं?"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 34-35","आचार्या: पितर: पुत्रास्तथैव च पितामहा: |\n" +
                "मातुला: श्वशुरा: पौत्रा: श्याला: सम्बन्धिनस्तथा || 34||\n" +
                "एतान्न हन्तुमिच्छामि घ्नतोऽपि मधुसूदन |\n" +
                "अपि त्रैलोक्यराज्यस्य हेतो: किं नु महीकृते || 35||","शिक्षक, पिता, पुत्र, दादा, मामा, पोते, ससुर, पोते, पोते, ससुर, पोते, बहनोई और अन्य रिश्तेदार यहां मौजूद हैं, अपने जीवन और धन को दांव पर लगाते हैं। हे मधुसूदन, मैं उन्हें मारना नहीं चाहता, भले ही वे मुझ पर हमला करें। यदि हम धृतराष्ट्र के पुत्रों का वध कर दें तो तीनों लोकों पर प्रभुता करने से हमें क्या संतोष मिलेगा, इस पृथ्वी की क्या बात करें?"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 36-37","निहत्य धार्तराष्ट्रान्न: का प्रीति: स्याज्जनार्दन |\n" +
                "पापमेवाश्रयेदस्मान्हत्वैतानाततायिन: || 36 ||\n" +
                "तस्मान्नार्हा वयं हन्तुं धार्तराष्ट्रान्स्वबान्धवान् |\n" +
                "स्वजनं हि कथं हत्वा सुखिन: स्याम माधव || 37||","हे सब जीवों के रखवाले, धृतराष्ट्र के पुत्रों को मारने से हमें क्या आनंद मिलेगा? भले ही वे आक्रमणकारी हों, लेकिन अगर हम उन्हें मारते हैं तो पाप निश्चित रूप से हमारे ऊपर आएगा। इसलिए, हमें अपने चचेरे भाइयों, धृतराष्ट्र के पुत्रों और दोस्तों को मारना शोभा नहीं देता है। हे माधव (कृष्ण), हम अपने ही रिश्तेदारों को मारकर खुश होने की उम्मीद कैसे कर सकते हैं?"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 38-39","यद्यप्येते न पश्यन्ति लोभोपहतचेतस: |\n" +
                "कुलक्षयकृतं दोषं मित्रद्रोहे च पातकम् || 38||\n" +
                "कथं न ज्ञेयमस्माभि: पापादस्मान्निवर्तितुम् |\n" +
                "कुलक्षयकृतं दोषं प्रपश्यद्भिर्जनार्दन || 39||","उनके विचार लालच से हावी हो जाते हैं और वे अपने रिश्तेदारों को नष्ट करने या दोस्तों पर विश्वासघात करने में कोई गलती नहीं देखते हैं। फिर भी, हे जनार्दन (कृष्ण), हम, जो अपने लोगों को मारने में अपराध को स्पष्ट रूप से देख सकते हैं, इस पाप से मुंह क्यों नहीं मोड़ें?"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 40","कुलक्षये प्रणश्यन्ति कुलधर्मा: सनातना: |\n" +
                "धर्मे नष्टे कुलं कृत्स्नमधर्मोऽभिभवत्युत || 40||","जब एक राजवंश नष्ट हो जाता है, तो उसकी परंपराएं खत्म हो जाती हैं, और बाकी परिवार अधार्मिकता में शामिल हो जाता है।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 41","अधर्माभिभवात्कृष्ण प्रदुष्यन्ति कुलस्त्रिय: |\n" +
                "स्त्रीषु दुष्टासु वार्ष्णेय जायते वर्णसङ्कर: || 41||","हे कृष्ण, विकार की प्रधानता से, परिवार की महिलाएं अनैतिक हो जाती हैं; और स्त्रियों की अनैतिकता से, हे वृष्णि के वंशज, अवांछित संतान उत्पन्न होती है।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 42","सङ्करो नरकायैव कुलघ्नानां कुलस्य च |\n" +
                "पतन्ति पितरो ह्येषां लुप्तपिण्डोदकक्रिया: || 42||","अवांछित संतानों की वृद्धि से परिवार और परिवार को नष्ट करने वालों दोनों का जीवन नारकीय बन जाता है। यज्ञ से वंचित होकर ऐसे भ्रष्ट परिवारों के पूर्वजों का भी पतन होता है।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 43","दोषैरेतै: कुलघ्नानां वर्णसङ्करकारकै: |\n" +
                "उत्साद्यन्ते जातिधर्मा: कुलधर्माश्च शाश्वता: || 43||","जो कुल-परम्परा को नष्ट करके अवांछित संतान को जन्म देते हैं, उनके कुकृत्यों से अनेक प्रकार की सामाजिक और पारिवारिक कल्याणकारी गतिविधियाँ नष्ट हो जाती हैं।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 44","उत्सन्नकुलधर्माणां मनुष्याणां जनार्दन |\n" +
                "नरकेऽनियतं वासो भवतीत्यनुशुश्रुम || 44||","हे जनार्दन (कृष्ण), मैंने विद्वानों से सुना है कि कुल की परंपराओं को नष्ट करने वाले अनिश्चित काल तक नरक में रहते हैं।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 45-46","अहो बत महत्पापं कर्तुं व्यवसिता वयम् |\n" +
                "यद्राज्यसुखलोभेन हन्तुं स्वजनमुद्यता: || 45||\n" +
                "यदि मामप्रतीकारमशस्त्रं शस्त्रपाणय: |\n" +
                "धार्तराष्ट्रा रणे हन्युस्तन्मे क्षेमतरं भवेत् || 46||","काश! यह कितनी अजीब बात है कि हमने भयानक परिणामों के साथ इस महान पाप को करने के लिए अपना मन बना लिया है। राज-सुख की लालसा से प्रेरित होकर हम अपने स्वजनों का वध करने पर आमादा हैं। यदि धृतराष्ट्र के पुत्र हाथ में शस्त्र लेकर युद्ध के मैदान में निहत्थे और निरंकुश मुझे मार दें तो अच्छा होगा।"));
        list1.add(new GeetaModel("Adhya 1","Geeta Slok 47","एवमुक्त्वार्जुन: सङ्ख्ये रथोपस्थ उपाविशत् |\n" +
                "विसृज्य सशरं चापं शोकसंविग्नमानस: || 47||","संजय ने कहा: इस प्रकार कहकर, अर्जुन ने अपना धनुष और बाण एक तरफ रख दिया, और अपने रथ के आसन में बैठ गया, उसका मन व्याकुल और शोक से व्याकुल हो गया।"));
//        list.add(new GeetaModel("Adhya 1","Geeta Slok 47","",""));


        addDataToList2();
        addDataToList3();
        addDataToList4();


        geetaRv = binding.geetaRV;
        LinearLayoutManager linearLayoutManager = new LinearLayoutManager(getContext(), RecyclerView.VERTICAL,false);
        geetaRv.setLayoutManager(linearLayoutManager);
        GeetaAdapter geetaAdapter = new GeetaAdapter(getContext(),list1);
        geetaRv.setAdapter(geetaAdapter);

        return binding.getRoot();
    }

    private void addDataToList4() {
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 1","इमम्, विवस्वते, योगम्, प्रोक्तवान्, अहम्, अव्ययम्,\n" +
                "विवस्वान्, मनवे, प्राह, मनुः, इक्ष्वाकवे, अब्रवीत्।।1।।","यह सनातन भक्ति मैंने सूर्य से कही थी, सूर्य ने अपने पुत्र वैवस्वत मनु से और मनु ने अपने पुत्र राजा इक्ष्वाकु से यह कहा था।"));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 2","एवम्, परम्पराप्राप्तम्, इमम्, राजर्षयः, विदुः,\n" +
                "सः, कालेन, इह, महता, योगः, नष्टः, परन्तप।।2।।","हे परंतप अर्जुन! इस तरह शाही संतों ने भक्ति के इस तरीके के बारे में सीखा जो नियमित उत्तराधिकार में दिया गया था। परन्तु उसके बाद वह योग अर्थात् भक्ति मार्ग दीर्घ काल व्यतीत होने के कारण इस लोक में लुप्त हो गया।"));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 3","सः, एव, अयम्, मया, ते, अद्य, योगः, प्रोक्तः, पुरातनः,\n" +
                "भक्तः, असि, मे, सखा, च, इति, रहस्यम्, हि, एतत्, उत्तमम्।।3।।","आप मेरे भक्त भी हैं और मित्र भी। इसलिए मैंने यही कहा है कि यह प्राचीन, पुराना और वास्तविक भक्ति मार्ग आपके लिए है क्योंकि यह एक परम रहस्य है अर्थात यह मामला गुप्त रखने योग्य है।"));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 4","अपरम्, भवतः, जन्म, परम्, जन्म, विवस्वतः,\n" +
                "कथम्, एतत्, विजानीयाम्, त्वम्, आदौ, प्रोक्तवान् इति।।4।।","आपका जन्म दीर्घकाल का नहीं है अर्थात् हाल ही का है और सूर्य का जन्म अति प्राचीन काल का है। मैं इसे कैसे समझूँ कि आपने ही युग के आदि में सूर्य से यह योग कहा था?"));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 5","बहूनि, मे, व्यतीतानि, जन्मानि, तव, च, अर्जुन,\n" +
                "तानि, अहम्, वेद, सर्वाणि, न, त्वम्, वेत्थ, परन्तप।।5।।","हे परंतप अर्जुन! आपके और मेरे कई जन्म हुए हैं। आप उन सभी को नहीं जानते लेकिन मैं जानता हूं।"));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 6","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 7","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 8","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 9","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 10","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 11","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 12","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 13","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 14","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 15","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 16","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 17","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 18","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 19","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 20","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 21","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 22","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 23","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 24","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 25","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 26","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 27","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 28","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 29","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 30","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 31","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 32","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 33","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 34","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 35","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 36","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 37","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 38","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 39","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 40","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 41","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 42","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 43","",""));
        list4.add(new GeetaModel("Adhya 4","Geeta Slok 37","",""));
    }

    private void addDataToList3() {
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 1","ज्यायसी, चेत्, कर्मणः, ते, मता, बुद्धिः, जनार्दन,\n" +
                "तत्, किम्, कर्मणि, घोरे, माम्, नियोजयसि, केशव।।1।।","हे जनार्दन! यदि तत्वदर्शी द्वारा दिये गये ज्ञान को कर्म की दृष्टि से श्रेष्ठ मानते हो तो हे केशव! गीता अध्याय 6 के श्लोक 10 से 15 में वर्णित गर्दन और सिर को सीधा रखकर एक स्थान पर बैठकर इन्द्रियों को वश में करने के इस घोर और निकृष्ट कार्य में आप मुझे क्यों लगाते हैं?"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 2","व्यामिश्रेण, इव, वाक्येन, बुद्धिम्, मोहयसि, इव, मे,\n" +
                "तत्, एकम्, वद, निश्चित्य, येन, श्रेयः, अहम्, आप्नुयाम्।।2।।","इस तरह के विरोधाभासी बयान मेरे दिमाग को भ्रमित कर रहे हैं। अतएव तुम मुझे निश्चयपूर्वक वह एक बात बताओ, जिससे मेरा कल्याण हो जाय।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 3","लोके, अस्मिन्, द्विविधा, निष्ठा, पुरा, प्रोक्ता, मया, अनघ,\n" +
                "ज्ञानयोगेन, साङ्ख्यानाम्, कर्मयोगेन, योगिनाम्।।3।।","अरे मासूम ! इस दुनिया में मेरे द्वारा पहले दो प्रकार के विश्वासों की व्याख्या की गई है। उनमें से (ज्ञानियों) ज्ञानियों की श्रद्धा ज्ञानयोग में अर्थात् अपनी बुद्धि से खींची हुई साधना के निष्कर्ष में होती है और योगियों की आस्था कर्मयोग अर्थात् सांसारिक कार्यों के अतिरिक्त साधना करने में होती है।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 4","न, कर्मणाम्, अनारम्भात्, नैष्कम्र्यम्, पुरुषः, अश्नुते,\n" +
                "न, च, सóयसनात्, एव, सिद्धिम्, समधिगच्छति।।4।।","शास्त्रों में वर्णित शास्त्रानुकूल साधना के साथ-साथ सांसारिक कार्यों को करने से जो परमात्मा अर्थात् पूर्ण मोक्ष प्राप्त होता है, वह बिना कर्म प्रारंभ किए प्राप्त नहीं होता। उदाहरण के लिए, अगर किसी को एक एकड़ में गेहूं की फसल काटनी है, तो वह कटाई की प्रक्रिया शुरू करने के बाद ही कटेगी। तब फसल काटने की क्रिया नहीं रहती और इसलिए केवल कर्मों का त्याग कर हठयोग द्वारा एक स्थान पर विशेष आसन पर बैठने से सिद्धि/अलौकिक शक्ति प्राप्त नहीं होती।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 5","न, हि, कश्चित्, क्षणम्, अपि, जातु, तिष्ठति, अकर्मकृत्,\n" +
                "कार्यते, हि, अवशः, कर्म, सर्वः, प्रकृतिजैः, गुणैः।।5।।","निस्सन्देह कोई भी व्यक्ति किसी भी समय क्षणमात्र भी कर्म किये बिना नहीं रहता। क्योंकि प्रकृति अर्थात् दुर्गा से उत्पन्न गुणों रजगुण ब्रह्मा, सतगुण विष्णु तथा तमगुण शिव जी से वशीभूत समस्त मानव जाति कर्म करने के लिए बाध्य है। (इसका प्रमाण अध्याय 14 के श्लोक 3-5 में भी है)"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 6","कर्मेन्द्रियाणि, संयम्य, यः, आस्ते, मनसा, स्मरन्,\n" +
                "इन्द्रियार्थान्, विमूढात्मा, मिथ्याचारः, सः, उच्यते।।6।।","जो अत्यंत मूढ़ मनुष्य सब कर्मेन्द्रियों को ऊपर से बलपूर्वक रोककर, भीतर से उन ज्ञानेन्द्रियों के विषयों का चिन्तन करता रहता है, वह कपटी अर्थात् पाखण्डी कहा जाता है। (इसका विस्तृत विवरण गीता अध्याय 17 श्लोक 19 में दिया गया है)"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 7","यः, तु, इन्द्रियाणि, मनसा, नियम्य, आरभते, अर्जुन,\n" +
                "कर्मेन्द्रियैः, कर्मयोगम्, असक्तः, सः, विशिष्यते।।7।।","लेकिन हे अर्जुन! जो मनुष्य इन्द्रियों को आन्तरिक रूप से वश में करके अनासक्त होकर कर्मयोग अर्थात् सांसारिक कार्यों के सम्पादन के साथ-साथ शास्त्रों के विधान के अनुसार भक्ति का आचरण करता है, वही श्रेष्ठ है।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 8","नियतम्, कुरु, कर्म, त्वम्, कर्म, ज्यायः, हि, अकर्मणः,\n" +
                "शरीरयात्रा, अपि, च, ते, न, प्रसिद्धयेत्, अकर्मणः।।8।।","शास्त्राविधि अनुसार कर्म करना चाहिए क्योंकि अकर्म की तुलना में अर्थात् कुश के बने विशेष आसन पर एकान्त स्थान में बैठकर बलपूर्वक भक्ति करने की तुलना में सांसारिक कार्यों को करते हुए भक्ति करना श्रेष्ठ है और कर्म न करने अर्थात् हठयोग करके यदि एकान्त में बैठे रहेंगे तो अपने शरीर और परिवार का भरण-पोषण भी नहीं हो पायेगा।\n"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 9","यज्ञार्थात्, कर्मणः, अन्यत्रा, लोकः, अयम्, कर्मबन्धनः,\n" +
                "तदर्थम्, कर्म, कौन्तेय, मुक्तसंगः, समाचर।।9।।","इस लोक में वही कर्मों में बंधता है अर्थात् चौरासी लाख जन्मों में अत्याचार सहता है, जो शास्त्राविधि त्यागकर यज्ञ अर्थात् धार्मिक कर्मों के निमित्त शास्त्रानुकूल कर्मों के स्थान पर अन्य कर्मों में लगा रहता है। . इसलिए हे अर्जुन! आसक्ति से मुक्त होकर उस शास्त्रानुकूल यज्ञ[2] के निमित्त सांसारिक कर्म करते हुए शास्त्रानुकूल भक्ति कर्म अर्थात् कर्तव्य कर्म [1] करना चाहिए; अर्थात् साधना शास्त्रों के अनुसार अर्थात् नियम के अनुसार ही करें।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 10","सहयज्ञाः, प्रजाः, सृष्टा , पुरा, उवाच, प्रजापतिः,\n" +
                "अनेन, प्रसविष्यध्वम्, एषः, वः, अस्तु, इष्टकामधुक्।।10।।","सभी प्राणियों के स्वामी प्रजापति ने सृष्टि के प्रारंभ में यज्ञ सहित सभी प्राणियों की रचना करके उनसे कहा कि अन्न से किए जाने वाले उस यज्ञ से तुम्हारा कल्याण हो सकता है जिसे धर्मयज्ञ कहा जाता है, जिसमें आम भोजन किया जाता है। आदि प्रदान किया जाता है, और यह यज्ञ में स्थित परमेश्वर ही आपको वांछित सुखों का दाता हो सकता है।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 11","देवान्, भावयत, अनेन, ते, देवाः, भावयन्तु, वः,\n" +
                "परस्परम् भावयन्तः, श्रेयः, परम्, अवाप्स्यथ।।11।।","\n" +
                "इस यज्ञ के द्वारा देवताओं अर्थात् शाखाओं को उन्नत करें और वे देवता अर्थात् शाखाएँ आप लोगों को समृद्ध करें अर्थात् संस्कारों के आधार पर फल प्रदान करें। इस प्रकार निःस्वार्थ रूप से एक दूसरे को समृद्ध करते हुए, तुम परम मंगल को प्राप्त करोगे।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 12","इष्टान् भोगान्, हि, वः, देवाः, दास्यन्ते, यज्ञभाविताः,\n" +
                "तैः दत्तान्, अप्रदाय, एभ्यः, यः, भुङ्क्ते, स्तेनः, एव, सः।।12।।","उन यज्ञों में स्थित देवता को अर्थात् पूर्ण परमात्मा को भोग लगाने के कारण यज्ञ से प्रसन्न होकर देवता उसका प्रतिफल भोग रूप में देते रहेंगे। जो उनके द्वारा दिए गए भौतिक सुखों को अर्पित किए बिना अर्थात् यज्ञ, दान आदि किए बिना स्वयं उसका सेवन करता है, वह वास्तव में चोर है।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 13","यज्ञशिष्टाशिनः, सन्तः, मुच्यन्ते, सर्वकिल्बिषैः,\n" +
                "भुजते, ते, तु, अघम्, पापाः, ये, पचन्ति, आत्मकारणात्।। 13।।","यज्ञ में स्थित देवता अर्थात् पूर्ण परमात्मा को प्रसाद चढ़ाकर जो साधु लोग खाते हैं, वे यज्ञ आदि न करने से होने वाले समस्त पापों से छूट जाते हैं और जो पापी मनुष्य केवल अपने शरीर को पुष्ट करने के लिए भोजन पकाते हैं, वे निश्चय ही पाप ही खाता है।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 14,15","अन्नात्, भवन्ति, भूतानि, पर्जन्यात्, अन्नसम्भवः,\n" +
                "यज्ञात्, भवति, पर्जन्यः, यज्ञः, कर्मसमुद्भवः।।14।।\n" +
                "\n" +
                "कर्म, ब्रह्मोद्भवम्, विद्धि, ब्रह्म, अक्षरसमुद्भवम्,\n" +
                "तस्मात्, सर्वगतम्, ब्रह्म, नित्यम्, यज्ञे, प्रतिष्ठितम्।।15।।","अन्न से प्राणी उत्पन्न होते हैं, वर्षा से अन्न उत्पन्न होता है, यज्ञ से वर्षा होती है, और नियत कर्मों से यज्ञ उत्पन्न होता है। ब्रह्म से उत्पन्न होने वाले कर्मों को और सनातन परमात्मा से उत्पन्न ब्रह्म अर्थात् क्षर पुरुष पर विचार करो। इससे सिद्ध हुआ कि सर्वव्यापक परमात्मा सदैव यज्ञों में स्थित रहता है अर्थात् यज्ञ का भाग ग्रहण कर फल देने वाला भी वही पूर्णब्रह्म है। (इसका प्रमाण पवित्र गीता अध्याय 4 के श्लोक 13 में भी है कि गुणों के आधार पर कर्मों को जोड़कर चार वर्ण (जातियां) बनाई हैं और कर्मों को जोड़ने वाला मैं ब्रह्म ही हूं।"));

        list3.add(new GeetaModel("Adhya 3","Geeta Slok 16","एवम्, प्रवर्तितम्, चक्रम्, न, अनुवर्तयति, इह, यः,\n" +
                "अघायुः, इन्द्रियारामः, मोघम्, पार्थ, सः, जीवति।।16।।","ओह पार्थ! इस संसार में जो इस प्रकार परम्परागत प्रकृति के चक्र के अनुसार कर्म नहीं करता अर्थात् जो अपने कर्तव्यों का पालन नहीं करता, वह पापी मनुष्य जो इन्द्रियों के द्वारा संसार के सुखों को भोगता है, वह व्यर्थ ही जीवित है।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 17","यः, तु, आत्मरतिः, एव, स्यात्, आत्मतृप्तः, च, मानवः,\n" +
                "आत्मनि, एव, च, सन्तुष्टः, तस्य, कार्यम्, न, विद्यते।।17।।","परन्तु जो मनुष्य वास्तव में आत्मा के साथ अविच्छिन्न रूप में रहने वाले परमात्मा में ही रमण करता है और एक परमात्मा में ही सन्तुष्ट है और केवल परमात्मा में ही सन्तुष्ट है, उसके लिए कोई कर्तव्य नहीं मालूम पड़ता।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 18","न, एव, तस्य, कृृतेन, अर्थः, न, अकृृतेन, इह, कश्चन,\n" +
                "न, च, अस्य, सर्वभूतेषु, कश्चित्, अर्थव्यपाश्रयः।।18।।","इस लोक में उस महापुरुष को न तो कर्म करने में रुचि है, न केवल कर्म न करने में ही रुचि है, और सर्व प्राणियों में रत्ती भर भी रस नहीं है। क्योंकि वह स्वार्थ से रहित होकर किसी से शास्त्रानुकूल पूजा नहीं कराता और न स्वयं करता है। न वह धन कमाने के उद्देश्य से साधना करता है और न दूसरों से करवाता है।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 19","तस्मात्, असक्तः, सततम्, कार्यम्, कर्म, समाचर,\n" +
                "असक्तः, हि, आचरन्, कर्म, परम्, आप्नोति, पूरुषः।।19।।","\n" +
                "इसलिए आसक्ति से मुक्त होकर सदा शास्त्रों के अनुसार अपने निर्धारित कर्तव्यों का पर्याप्त रूप से पालन करते रहो क्योंकि इच्छाओं से मुक्त होकर भक्ति के कार्य करने से तुम परमेश्वर को प्राप्त करोगे।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 20","कर्मणा, एव, हि, संसिद्धिम्, आस्थिताः, जनकादयः,\n" +
                "लोकसंग्रहम्, एव, अपि, सम्पश्यन्, कर्तुम्, अर्हसि।।20।।","जनक आदि ने भी आसक्तिरहित कर्मों से ही परम आध्यात्मिक सिद्धि प्राप्त की। इस कारण और संसार के कल्याण को ध्यान में रखते हुए आपको सांसारिक कार्यों के अलावा शास्त्रों के अनुसार कर्म करना चाहिए अर्थात कर्म करना आपके लिए बेहतर है"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 21","यत्, यत् आचरति, श्रेष्ठः, तत्, तत्, एव, इतरः, जनः,\n" +
                "सः, यत्, प्रमाणम्, कुरुते, लोकः, तत्, अनुवर्तते।।21।।","महापुरुष अर्थात् शास्त्र विधि से साधना करने वाला भक्त जो कुछ करता है, दूसरे पुरुष भी वैसा ही करते हैं। वह जो भी मानक निर्धारित करता है, सभी लोग उसका पालन करने लगते हैं।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 22","न, मे, पार्थ, अस्ति, कर्तव्यम्, त्रिषु, लोकेषु, किंचन\n" +
                "न, अनवाप्तम्, अवाप्तव्यम्, वर्ते, एव, च, कर्मणि।।22।।","हे अर्जुन! इन तीनों लोकों में न तो मेरा कोई कर्तव्य है और न ही मुझे कोई प्राप्त होने वाली वस्तु प्राप्त हुई है; फिर भी मैं कर्म में ही लगा रहता हूँ।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 23","यदि, हि, अहम्, न, वर्तेयम्, जातु, कर्मणि, अतन्द्रितः,\n" +
                "मम, वत्र्म, अनुवर्तन्ते, मनुष्याः, पार्थ, सर्वशः।।23।।","क्योंकि हे पार्थ! यदि कभी मैं सावधानी से कर्मों में नहीं लगा तो बहुत हानि हो सकती है क्योंकि मनुष्य सब प्रकार से मेरे ही मार्ग पर चलते हैं।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 24","उत्सीदेयुः, इमे, लोकाः, न, कुर्याम्, कर्म, चेत्, अहम्,\n" +
                "संकरस्य, च, कर्ता, स्याम्, उपहन्याम्, इमाः, प्रजाः।।24।।","यदि मैं कर्म न करूँ तो ये सब मनुष्य पूरी तरह से नष्ट हो जाएँगे और मैं मिश्रित जातियों (विभिन्न जातियों के पुरुष और स्त्री के योग से उत्पन्न) का कारण बनूँगा और इन सभी लोगों का नाश करने वाला बनूँगा।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 25","सक्ताः, कर्मणि, अविद्वांसः, यथा, कुर्वन्ति, भारत,\n" +
                "कुर्यात्, विद्वान्, तथा, असक्तः, चिकीर्षुः, लोकसङ्ग्रहम्।।25।।","हे भरत! जिस प्रकार कर्मों में आसक्त अज्ञानी मनुष्य शास्त्रानुकूल कर्म करते हैं, उसी प्रकार आसक्ति रहित ज्ञानी पुरुष को भी चाहिए कि लोगों को एकत्र करने की इच्छा से शिष्य बनाने की इच्छा से शास्त्रविधि के अनुसार उपर्युक्त कर्म करें।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 26","न, बुद्धिभेदम्, जनयेत्, अज्ञानाम्, कर्मसंगिनाम्,\n" +
                "जोषयेत्, सर्वकर्माणि, विद्वान्, युक्तः, समाचरन्।।26।।","शास्त्रविरुद्ध साधना से हानि और शास्त्रानुकूल साधना से लाभ स्पष्ट देखकर (ज्ञानी को) परिवर्तन नहीं करना चाहिए अर्थात् अशिक्षितों को भ्रमित नहीं करना चाहिए अर्थात् अज्ञानियों को शास्त्रानुकूल ज्ञान आधारित भक्ति कर्मों पर दृढ़ नहीं होना चाहिए। शास्त्रानुकूल उपासकों ने यह कहकर दिया कि तुम अशिक्षित हो, तुम सच्ची उपासना के बारे में क्या जानते हो। शास्त्रविरुद्ध अन्य साधनाओं में लीन ज्ञानी को अपने अहंकार के कारण उन्हें भ्रमित नहीं करना चाहिए और स्वयं भक्ति के कार्यों को ठीक से करते हुए उन्हें भी कराना चाहिए अर्थात उन्हें गुमराह करने के बजाय उन्हें प्रोत्साहित करना चाहिए।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 27","प्रकृतेः, क्रियमाणानि, गुणैः, कर्माणि, सर्वशः,\n" +
                "अहंकारविमूढात्मा, कर्ता, अहम्, इति, मन्यते।।27।।","प्रकृति-दुर्गा से उत्पन्न तीनों गुणों अर्थात् रजगुण ब्रह्मा, सतगुण विष्णु, तमगुण शिव जी द्वारा संस्कारों के आधार पर सभी कर्म सब प्रकार से सम्पन्न होते हैं; शिक्षित होते हुए भी तत्वज्ञान से रहित अहंकारी अज्ञानी व्यक्ति ऐसा सोचता है - \"मैं कर्ता हूँ\"।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 28","तत्त्ववित्, तु, महाबाहो, गुणकर्मविभागयोः,\n" +
                "गुणाः, गुणेषु, वर्तन्ते, इति, मत्वा, न, सज्जते।।28।।","लेकिन ओह ग्रेट-आर्म्ड! एक ज्ञानी व्यक्ति जो गुणों और कर्मों के संबंधित क्षेत्रों के बारे में सच्चाई जानता है यानी एक तत्वदर्शी, यह समझने के बाद कि सभी गुण (तीन गुण, रजगुण, सतगुण, तमगुण) ही गुणों (तीनों भगवान) में अभिनय कर रहे हैं उनकी ओर आकर्षित न हों। अर्थात् तीनों गुणों - रजगुण ब्रह्मा जी, सतगुण विष्णु जी, तमगुण शिव जी में जितनी शक्तियाँ होती हैं, उससे पूर्ण परिचित व्यक्ति का इन पर इतना ही विश्वास रह जाता है। (इसका प्रमाण गीता अध्याय 2 के श्लोक 45-46 में भी है।) अहंकार को त्यागकर वह तुरंत शास्त्रानुकूल साधना करने लगता है।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 29","प्रकृृतेः, गुणसम्मूढाः, सज्जन्ते, गुणकर्मसु,\n" +
                "तान्, अकृत्स्न्नविदः, मन्दान्, कृत्स्न्नवित्, न, विचालयेत्।।29।।","मूर्ख व्यक्ति, तीन गुणों से अत्यंत मोहित, प्रकृति से उत्पन्न प्रकृति के पुत्र, अर्थात् रजगुण ब्रह्मा जी, सतगुण विष्णु जी, तमगुण शिव जी, गुण अर्थात् तीनों देवताओं की साधना के कार्यों में मग्न रहते हैं। सत्य भक्ति को जानने वाला अर्थात् शास्त्रानुकूल साधना करने वाला ज्ञानी मंदबुद्धि अशिक्षितों अर्थात् अज्ञानियों को विचलित नहीं कर सकता, जो पूर्ण रूप से नहीं समझते अर्थात् शास्त्रानुकूल साधना को स्वभावतः त्याग कर धर्म पर दृढ़ रहते हैं। तीनों गुणों अर्थात श्री ब्रह्मा जी, श्री विष्णु जी, श्री शिव जी की गलत साधना से साधना; वे निश्चय ही नाश हो गए हैं। इसका प्रमाण गीता अध्याय 7 श्लोक 12-15 में भी दिया है।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 30","मयि, सर्वाणि, कर्माणि, सóयस्य, अध्यात्मचेतसा,\n" +
                "निराशीः, निर्ममः, भूत्वा, युध्यस्व, विगतज्वरः।।30।।","पूर्ण परमात्मा में मन लगाकर सब कर्मों को मुझमें अर्पण करके कामना, मालकियत और शोक से रहित होकर युद्ध करो। इसका प्रमाण गीता अध्याय 18 श्लोक 66 में भी दिया है कि सर्व धर्म कर्मों को मुझमें छोड़कर परमात्मा की शरण में जाओ।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 31","ये, मे, मतम्, इदम्, नित्यम्, अनुतिष्ठन्ति, मानवाः,\n" +
                "श्रद्धावन्तः, अनसूयन्तः, मुच्यन्ते, ते, अपि, कर्मभिः।।31।।","जो मनुष्य दोषों से रहित और श्रद्धापूर्वक सदा इस मत अर्थात् मेरे इस सिद्धांत का पालन करते हैं, वे शास्त्रविधि के त्यागने अर्थात् नियमों के त्याग करने पर किये हुए दोषपूर्ण कर्मों से बच जाते हैं।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 32","ये, तु, एतत्, अभ्यसूयन्तः, न, अनुतिष्ठन्ति, मे, मतम्,\n" +
                "सर्वज्ञानविमूढान्, तान्, विद्धि, नष्टान्, अचेतसः।।32।।","परन्तु जो लोग दोष लगाते हैं और इस मत अर्थात् मेरे सिद्धांत का पालन नहीं करते हैं, उन मूर्खों को समस्त विद्याओं में आसक्त और नष्ट होने वाला ही समझते हैं।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 33","सदृशम्, चेष्टते, स्वस्याः, प्रकृतेः, ज्ञानवान्, अपि,\n" +
                "प्रकृतिम्, यान्ति, भूतानि, निग्रहः, किम्, करिष्यति।।33।।","सभी जीव अपने स्वभाव का पालन करते हैं। ज्ञानी व्यक्ति भी अपने स्वभाव के अनुसार अपने द्वारा सिद्ध किये गये भक्ति मार्ग के आधार पर प्रयत्न करते हैं। क्या (हाथ) पूरा करने पर रोक लगाएगा?"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 34","इन्द्रियस्य, इन्द्रियस्य, अर्थे, रागद्वेषौ, व्यवस्थितौ,\n" +
                "तयोः, न, वशम्, आगच्छेत्, तौ, हि, अस्य, परिपन्थिनौ।।34।।","प्रेम और घृणा प्रत्येक इंद्रिय की वस्तु में छिपे हुए हैं। इनके वश में नहीं आना चाहिए क्योंकि ये दोनों ही इनके बाधक महाशत्रु हैं।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 35","श्रेयान्, स्वधर्मः, विगुणः, परधर्मात्, स्वनुष्ठितात्,\n" +
                "स्वधर्मे, निधनम्, श्रेयः, परधर्मः, भयावहः।।35।।","दूसरों की मनमानी पूजा से अपनी शास्त्रानुकूल साधना बहुत अच्छी होती है, जो आचरण में तो बहुत अच्छी होती है, पर गुणहीन होती है अर्थात् शास्त्राविधि त्याग कर की जाती है। अपनी इबादत में मरना भी फायदेमंद है और दूसरे की इबादत डराने वाली।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 36","अथ, केन, प्रयुक्तः, अयम्, पापम्, चरति, पूरुषः,\n" +
                "अनिच्छन्, अपि, वाष्र्णेय, बलात्, इव, नियोजितः।।36।।","हे कृष्ण! फिर किससे प्रेरित होकर यह मनुष्य स्वयं भी अनिच्छा से यह पाप करता है, मानो बल से प्रेरित हो।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 37","कामः, एषः, क्रोधः, एषः, रजोगुणसमुद्भवः,\n" +
                "महाशनः, महापाप्मा, विद्धि, एनम्, इह, वैरिणम्।।37।।","रजोगुण से उत्पन्न यह काम अर्थात् काम और यह क्रोध अति खाने वाला अर्थात् जीव का नाश करने वाला महापापी है। इस मामले में आप उपरोक्त पाप को ही शत्रु मान सकते हैं।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 38","धूमेन, आव्रियते, वह्निः, यथा, आदर्शः, मलेन, च,\n" +
                "यथा, उल्बेन, आवृतः, गर्भः, तथा, तेन, इदम्, आवृृतम्।।38।।","जैसे धुएँ से अग्नि और धूल से शीशा ढका रहता है, वैसे ही भ्रूण गर्भावरण से ढका रहता है; इसी प्रकार यह ज्ञान भी उपरोक्त दोषों से आच्छादित है।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 39","आवृतम्, ज्ञानम्, एतेन, ज्ञानिनः, नित्यवैरिणा,\n" +
                "कामरूपेण, कौन्तेय, दुष्पूरेण, अनलेन, च।।39।।","और हे कुन्तीपुत्र अर्जुन! मनुष्य का ज्ञान ज्ञानियों के काम रूपी शाश्वत शत्रु द्वारा आच्छादित है जो इस अग्नि की तरह कभी भी तृप्त नहीं हो सकता।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 40","इन्द्रियाणि, मनः, बुद्धिः, अस्य, अधिष्ठानम्, उच्यते,\n" +
                "एतैः, विमोहयति, एषः, ज्ञानम्, आवृत्य, देहिनम्।।40।।","इन्द्रियाँ, मन और बुद्धि- ये सब इसी कामदेव अर्थात् कामवासना के निवास स्थान कहे गए हैं। मन, बुद्धि और इन्द्रियों के माध्यम से ही ज्ञान को आच्छादित करके यह यौन सुख की इच्छा आत्मा को आकर्षित करती है।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 41","तस्मात्, त्वम्, इन्द्रियाणि, आदौ, नियम्य, भरतर्षभ,\n" +
                "पाप्मानम्, प्रजहि, हि, एनम्, ज्ञानविज्ञाननाशनम्।।41।।","इसलिए, हे भरत के वंशज, अर्जुन! तुम सर्वप्रथम इन्द्रियों को वश में करके ज्ञान और विज्ञान के इस विनाशक महा पापी लिंग का अवश्य ही संहार करो।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 42","इन्द्रियाणि, पराणि, आहुः, इन्द्रियेभ्यः, परम्, मनः,\n" +
                "मनसः, तु, परा, बुद्धिः, यः, बुद्धेः, परतः, तु, सः।।42।।","भौतिक शरीर की तुलना में इंद्रियों को श्रेष्ठ, शक्तिशाली और सूक्ष्म कहा गया है; मन इन इन्द्रियों से श्रेष्ठ है; हालाँकि, बुद्धि मन से श्रेष्ठ है और जो बुद्धि से भी अधिक शक्तिशाली है वह आत्मा है जिसके साथ भगवान हैं।"));
        list3.add(new GeetaModel("Adhya 3","Geeta Slok 43","एवम्, बुद्धेः, परम्, बुद्ध्वा, संस्तभ्य, आत्मानम्, आत्मना,\n" +
                "जहि, शत्रुम्, महाबाहो, कामरूपम्, दुरासदम्।।43।।","इस प्रकार भगवान् को बुद्धि से परम श्रेष्ठ और स्वयं को साधना से संयमी समझकर हे महाबाहु अर्जुन! आप इस कामरूपी (कामुक) अजेय शत्रु को मार सकते हैं।"));
    }

    private void addDataToList2() {
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 1","तम्, तथा, कृपया, आविष्टम्, अश्रुपूर्णाकुलेक्षणम्,\n" +
                "विषीदन्तम्, इदम्, वाक्यम्, उवाच, मधुसूदनः।।1।।","और इस प्रकार मधुसूदन भगवान् ने करुणा से विभूषित, व्याकुल नेत्रों वाले, व्याकुल और ममता के अन्धकार में डूबे हुए अर्जुन से यह कथन कहा।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 2","कुतः, त्वा, कश्मलम्, इदम्, विषमे, समुपस्थितम्,\n" +
                "अनार्यजुष्टम्, अस्वग्र्यम्, अकीर्तिकरम्, अर्जुन।।2।।","हे अर्जुन! इस दु:खद अनुपयुक्त समय में यह स्नेह किस उद्देश्य से आपके पास आया? क्योंकि यह हीन पुरुषों का चरित्र है; यह स्वर्ग की ओर नहीं ले जाएगा और केवल अपमान लाने वाला है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 3","क्लैब्यम्, मा, स्म, गमः, पार्थ, न, एतत्, त्वयि, उपपद्यते,\n" +
                "क्षुद्रम् हृदयदौर्बल्यम्, त्यक्त्वा, उत्तिष्ठ, परन्तप।।3।।","हे अर्जुन! नपुंसकता के आगे न झुकें। यह तुम्हें शोभा नहीं देता। हे परंतप! हृदय की इस क्षुद्र दुर्बलता को त्याग कर युद्ध के लिए खड़े हो जाओ।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 4","कथम्, भीष्मम्, अहम्, सङ्ख्ये, द्रोणम्, च, मधुसूदन,\n" +
                "इषुभिः, प्रति, योत्स्यामि, पूजार्हौ, अरिसूदन।।4।।","हे मधुसूदन! मैं युद्ध के मैदान में भीष्म पितामह और द्रोणाचार्य के खिलाफ बाणों से कैसे लड़ूंगा? क्योंकि हे अरिसूदन! वे दोनों पूज्य हैं।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 5","गुरून्, अहत्वा, हि, महानुभावान्, श्रेयः, भोक्तुम्,\n" +
                "भैक्ष्यम्, अपि, इह, लोके, हत्वा, अर्थकामान्, तु,\n" +
                "गुरून्, इह, एव, भुजीय, भोगान्, रुधिरप्रदिग्धान्,।। 5।।","मैं तो बड़े-बड़े गुरुओं को मारने के स्थान पर इस संसार में भिक्षा का भोजन करना भी शुभ मानता हूँ। क्योंकि गुरुजनों को मारकर भी मैं इस संसार में केवल रक्तरंजित धन और वासनारूपी सुख भोगूंगा।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 6","न, च, एतत्, विध्मः, कतरत्, नः, गरीयः, यत्, वा,\n" +
                "जयेम, यदि, वा, नः, जयेयुः, यान् एव, हत्वा, न,\n" +
                "जिजीविषामः, ते, अवस्थिताः, प्रमुखे, धार्तराष्ट्राः।।6।।","और हम यह भी नहीं जानते कि इन दोनों में से हमारे लिए क्या अच्छा है कि हम युद्ध करें या न करें और यह भी नहीं जानते कि हम उन्हें जीत लेंगे या वे हम पर विजय प्राप्त कर लेंगे। और जिसे मारकर हम जीने की इच्छा भी नहीं रखते, वे ही धृतराष्ट्र के पुत्र ही युद्ध में खड़े हैं।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 7","कार्पण्यदोषोपहतस्वभावः, पृच्छामि, त्वाम्,\n" +
                "धर्मसम्मूढचेताः, यत्, श्रेयः, स्यात्, निश्चितम्, ब्रूहि,\n" +
                "तत्, मे, शिष्यः, ते, अहम्, शाधि, माम्, त्वाम्, प्रपन्नम्।।7।।","मैं कायरता के दोष से अभिभूत और धर्म के विषय में मोहित होने के स्वभाव से आपसे पूछता हूँ कि जो कुछ मेरे लिए निश्चित रूप से शुभ है वह मुझे बताएं क्योंकि मैं आपका शिष्य हूँ। अतः जो आपकी शरण में है, मुझे शिक्षा दीजिए।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 8","न, हि, प्रपश्यामि, मम, अपनुद्यात्, यत्, शोकम्, उच्छोषणम्, इन्द्रियाणाम्,\n" +
                "अवाप्य, भूमौ, असपत्नम्, ऋद्धम्, राज्यम्, सुराणाम्, अपि,च,आधिपत्यम्।।8।।","अर्जुन कह रहा है कि भगवन, यदि मैं सारी पृथ्वी का राज्य अथवा देवताओं के स्वामी इन्द्र का पद प्राप्त कर लूं तो मुझे नहीं लगता कि कोई मुझे युद्ध के लिए तैयार कर सकता है अर्थात् मैं युद्ध नहीं करूँगा। यह कहकर वह चुप हो गया।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 9","एवम्, उक्त्वा, हृषीकेशम्, गुडाकेशः, परन्तप,\n" +
                "न, योत्स्ये, इति, गोविन्दम्, उक्त्वा, तूष्णीम्, बभूव, ह।।9।।","हे राजा! इस प्रकार अंतर्यामी (सर्वज्ञ) श्रीकृष्ण महाराज से कहकर निद्राजीत अर्जुन ने भगवान श्री गोविन्द से स्पष्ट कह दिया कि मैं युद्ध नहीं करूँगा और मौन हो गया।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 10","तम्, उवाच, हृषीकेशः, प्रहसन्, इव, भारत,\n" +
                "सेनयोः, उभयोः, मध्ये, विषीदन्तम्, इदम्, वचः।।10।।","हे भरत के वंशज, धृतराष्ट्र! अन्तर्यामी/सर्वज्ञ श्रीकृष्ण ने दोनों सेनाओं के मध्य में शोक करते हुए उस अर्जुन से हँसते हुए ये वचन कहे।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 11","अशोच्यान्, अन्वशोचः, त्वम्, प्रज्ञावादान्, च, भाषसे,\n" +
                "गतासून्, अगतासून्, च, न, अनुशोचन्ति, पण्डिताः।।11।।","आप उन पुरुषों के लिए शोक कर रहे हैं जो शोक करने के योग्य नहीं हैं, और पंडितों की तरह बयान कर रहे हैं, लेकिन पंडित उनके लिए शोक नहीं करते हैं जो मर चुके हैं और जो जीवित हैं उनके लिए भी।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 12","न, तु, एव, अहम्, जातु, न, आसम्, न, त्वम्, न, इमे, जनाधिपाः,\n" +
                "न, च, एव, न, भविष्यामः, सर्वे, वयम्, अतः, परम्।।12।।","न ऐसा है कि मैं कभी न था, न तुम थे, न ये राजा थे, और न ऐसा है कि इसके आगे हम न होंगे।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 13","देहिनः, अस्मिन्, यथा, देहे, कौमारम्, यौवनम्, जरा,\n" +
                "तथा, देहान्तरप्राप्तिः, धीरः, तत्रा, न, मुह्यति।।13।।","जैसे इस शरीर में आत्मा का बचपन, जवानी और बुढ़ापा होता है; उसी प्रकार यह दूसरा शरीर प्राप्त करता है। धीर पुरुष उस विषय पर मोहित नहीं होता।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 14","मात्रास्पर्शाः, तु, कौन्तेय, शीतोष्णसुखदुःखदाः,\n" +
                "आगमापायिनः, अनित्याः, तान्, तितिक्षस्व, भारत।।14।।","हे कुंतीपुत्र! शीत, उष्ण, सुख-दु:ख देने वाले इन्द्रियों और उनके विषयों के सम्पर्क आते-जाते हैं अर्थात् अस्थायी होते हैं; इसलिए, हे भरत! तू इनको सहन कर।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 15","यम्, हि, न, व्यथयन्ति, एते, पुरुषम्, पुरुषर्षभ,\n" +
                "समदुःखसुखम्, धीरम्, सः, अमृतत्वाय, कल्पते।।15।।","क्योंकि हे पुरुषों में श्रेष्ठ ! जो सुख-दुःख को समान मानता है, स्थिर अर्थात् तत्वदर्शी मनुष्य, जिसे ये विचलित नहीं करते, वह पूर्ण परमात्मा के सुख का अधिकारी है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 16","न, असतः, विद्यते, भावः, न, अभावः, विद्यते, सतः,\n" +
                "उभयोः, अपि, दृष्टः, अन्तः, तु, अनयोः, तत्त्वदर्शिभिः।।16।।","नाशवान वस्तु का अस्तित्व ज्ञात नहीं होता और अविनाशी के अभाव/विनाश का पता नहीं चलता, अत: इन दोनों की सत्यता/वास्तविकता को भी तत्वज्ञानी अर्थात् तत्वदर्शी संतों ने माना है। (इसका प्रमाण गीता अध्याय 4 श्लोक 34 में है)।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 17","अविनाशि, तु, तत्, विद्धि, येन्, सर्वम्, इदम्, ततम्,\n" +
                "विनाशम्, अव्ययस्य, अस्य, न, कश्चित्, कर्तुम्, अर्हति।।17।।","जिससे यह सारा दृश्य जगत व्याप्त है, उसे अविनाशी/अमर जानना चाहिए। इस अमर को नष्ट करने में कोई भी सक्षम नहीं है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 18","अन्तवन्तः, इमे, देहाः, नित्यस्य, उक्ताः, शरीरिणः,\n" +
                "अनाशिनः, अप्रमेयस्य, तस्मात्, युध्यस्व, भारत।।18।।","पंचतत्वों से बना यह शरीर नाशवान है। अमर परमात्मा हमेशा शरीर में आत्मा के साथ रहता है। एक साधारण उपासक पूर्ण परमात्मा और आत्मा के अविभाज्य संबंध से अपरिचित है। इसलिए असिद्ध को अविनाशी कहा गया है, जो सदैव आत्मा के साथ रहता है। इसलिए, हे भरत के वंशज, अर्जुन! लड़ाई"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 19","यः, एनम्, वेत्ति, हन्तारम्, यः, च, एनम्, मन्यते, हतम्,\n" +
                "उभौ तौ, न, विजानीतः, न, अयम्, हन्ति, न, हन्यते।।19।।","जो इसे मारने वाला मानता है और जो इसे मारने वाला मानता है, वे दोनों नहीं जानते क्योंकि वास्तव में वह न तो किसी को मारता है और न ही किसी के द्वारा मारा जाता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 20","न, जायते, म्रियते, वा, कदाचित्, न, अयम्, भूत्वा, भविता, वा, न,\n" +
                "भूयः, अजः, नित्यः, शाश्वतः, अयम्, पुराणः, न, हन्यते, हन्यमाने, शरीरे।।20।।","यह न तो किसी काल में जन्म लेती है, न कभी मरती है और न ही जन्म लेने के बाद फिर से अस्तित्व में आने वाली है, क्योंकि यह अजन्मा, नित्य, नित्य और आदि है। शरीर के मारे जाने पर यह मारा भी नहीं जाता।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 21","वेद, अविनाशिनम्, नित्यम्, यः, एनम्, अजम्, अव्ययम्,\n" +
                "कथम्, सः, पुरुषः, पार्थ, कम्, घातयति, हन्ति, कम्।।21।।","हे अर्जुन! जो इस परमात्मा को आत्मा सहित अविनाशी, सनातन, अजन्मा और अमर जानता है, वह किसकी हत्या करता है और कैसे किसी को मारता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 22","वासांसि, जीर्णानि, यथा, विहाय, नवानि, गृह्णतिः, नरः, अपराणि,\n" +
                "तथा, शरीराणि, विहाय, जीर्णानि, अन्यानि, संयाति, नवानि, देही।।22।।","जैसे मनुष्य पुराने वस्त्रों को त्याग कर दूसरे नये वस्त्रों को धारण करता है; इसी प्रकार जीवात्मा पुराने शरीरों को त्याग कर अन्य नए शरीरों को प्राप्त करता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 23","न, एनम्, छिन्दन्ति, शस्त्राणि, न, एनम्, दहति, पावकः,\n" +
                "न, च, एनम्, क्लेदयन्ति, आपः, न, शोषयति, मारुतः।।23।।","शस्त्र उसे काट नहीं सकते; अग्नि उसे जला नहीं सकती, जल उसे घोल नहीं सकता और वायु उसे सुखा नहीं सकती।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 24","अच्छेद्यः, अयम्, अदाह्यः, अयम्, अक्लेद्यः, अशोष्यः, एव, च,\n" +
                "नित्यः, सर्वगतः, स्थाणुः, अचलः, अयम्, सनातनः।।24।।","यह अविभाज्य है। यह ईश्वर अज्वलनशील, अघुलनशील और निस्संदेह सुखाया नहीं जा सकता है, और यह ईश्वर अनादि, सर्वव्यापी, अचल, स्थायी और सदा विद्यमान है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 25","अव्यक्तः, अयम्, अचिन्त्यः, अयम्, अविकार्यः, अयम्, उच्यते,\n" +
                "तस्मात्, एवम्, विदित्वा, एनम्, न, अनुशोचितुम्, अर्हसि।।25।।","यह परमात्मा इस आत्मा के साथ गुप्त रूप से रहता है। यह ईश्वर अकल्पनीय है और इसे दोष रहित कहा गया है। इसलिए हे अर्जुन! इस प्रकार इस परमात्मा को जानने के बाद तुम शोक करने के योग्य नहीं हो अर्थात् तुम्हारे लिए शोक करना उचित नहीं है। तात्पर्य यह है कि जब परमात्मा जीव के साथ है तो जीव को कोई हानि नहीं हो सकती।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 26","अथ, च, एनम्, नित्यजातम्, नित्यम्, वा, मन्यसे, मृतम्,\n" +
                "तथापि त्वम्, महाबाहो, न, एवम्, शोचितुम्, अर्हसि।।26।।","और यदि इसके बाद भी तुम उन्हें निरन्तर जन्मते और सदा मरते हुए समझते हो, तो भी हे महाबाहु! तुम इस तरह शोक करने के योग्य नहीं हो।\n"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 27","जातस्य, हि, ध्रुवः, मृत्युः, ध्रुवम्, जन्म, मृतस्य, च,\n" +
                "तस्मात्, अपरिहार्ये, अर्थे, न, त्वम्, शोचितुम्, अर्हसि।।27।।","क्योंकि जिसका जन्म हुआ है उसकी मृत्यु निश्चित है और जो मर गया है उसका पुनर्जन्म निश्चित है। इससे भी तुम इस अपरिहार्य विषय में शोक करने के योग्य नहीं हो।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 28","अव्यक्तादीनि, भूतानि, व्यक्तमध्यानि, भारत,\n" +
                "अव्यक्तनिधनानि, एव, तत्रा, का, परिदेवना।।28।।","हे अर्जुन! सभी जीव जन्म से पहले अव्यक्त थे और मृत्यु के बाद अव्यक्त हो जाएंगे। वे मध्य में ही प्रकट होते हैं। फिर ऐसी स्थिति में शोक करने की क्या बात है?"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 29","आश्चर्यवत्, पश्यति, कश्चित्, एनम्, आश्चर्यवत्,\n" +
                "वदति, तथा, एव, च, अन्यः, आश्चर्यवत्, च, एनम्, अन्यः,\n" +
                "श्रृणोति, श्रुत्वा, अपि, एनम्, वेद, न, च, एव, कश्चित्।।29।।","कोई विरला ही इस परमात्मा को आत्मा सहित विस्मय में देखता है और इसी प्रकार कोई महापुरुष विस्मय में वर्णन ही करता है और कोई विस्मय से सुनता भी है और कोई यह सुनकर भी नहीं जानता।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 30","देही, नित्यम्, अवध्यः, अयम्, देहे, सर्वस्य, भारत,\n" +
                "तस्मात्, सर्वाणि, भूतानि, न, त्वम्, शोचितुम्, अर्हसि।।30।।","हे अर्जुन! यह आत्मा परमात्मा सहित सबके शरीर में सदा अमर है। अतः आप समस्त प्राणियों के लिए शोक करने योग्य नहीं हैं"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 31","स्वधर्मम्, अपि, च, अवेक्ष्य, न, विकम्पितुम्, अर्हसि,\n" +
                "धम्र्यात्, हि, युद्धात्, श्रेयः, अन्यत्, क्षत्रियस्य, न, विद्यते।।31।।","साथ ही अपने शास्त्रानुकूल धर्म का विचार करके भी तुम्हें डरना नहीं चाहिए क्योंकि क्षत्रिय के लिए धर्मयुद्ध से बढ़कर और कोई कर्तव्य नहीं माना जाता।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 32","यदृच्छया, च, उपपन्नम्, स्वर्गद्वारम्, अपावृतम्,\n" +
                "सुखिनः, क्षत्रियाः, पार्थ, लभन्ते, युद्धम्, ईदृशम्।।32।।","ओह पार्थ! सौभाग्यशाली क्षत्रियों को ही ऐसी लड़ाई लड़ने का अवसर मिलता है जो अपने आप आती \u200B\u200Bहै और स्वर्ग के खुले द्वार के समान है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 33","अथ, चेत्, त्वम्, इमम्, धम्र्यम्, सङ्ग्रामम्, न, करिष्यसि,\n" +
                "ततः, स्वधर्मम्, कीर्तिम्, च, हित्वा, पापम्, अवाप्स्यसि।।33।।","परन्तु यदि तुम इस धर्म ज्ञान के आधार पर युद्ध नहीं करोगे तो अपने समान धर्म और कीर्ति को खोकर पाप को प्राप्त होगे।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 34","अकीर्तिम्, च, अपि, भूतानि, कथयिष्यन्ति, ते, अव्ययाम्,\n" +
                "सम्भावितस्य, च, अकीर्तिः, मरणात्, अतिरिच्यते।।34।।","और सब लोग तेरी दीर्घकालीन अपकीर्ति की चर्चा करेंगे और एक प्रतिष्ठित व्यक्ति के लिए अपकीर्ति मृत्यु से भी बढ़कर है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 35","भयात्, रणात्, उपरतम्, मंस्यन्ते, त्वाम्, महारथाः,\n" +
                "येषाम्, च, त्वम्, बहुमतः, भूत्वा, यास्यसि, लाघवम्।।35।।","और जिनकी दृष्टि में तुम पहले बड़े आदरणीय थे और अब तुच्छ हो जाओगे, वे महारथी योद्धा तुम्हें भय के मारे युद्ध से पीछे हटे हुए समझेंगे।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 36","अवाच्यवादान्, च, बहून्, वदिष्यन्ति, तव, अहिताः,\n" +
                "निन्दन्तः, तव, सामथ्र्यम्, ततः, दुःखतरम्, नु, किम्।।36।।","आपके विरोधी आपकी काबिलियत की आलोचना करते हुए आपको कई अपशब्द भी बोलेंगे। इससे ज्यादा शर्मनाक और क्या होगा?"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 37","हतः, वा, प्राप्स्यसि, स्वर्गम्, जित्वा, वा, भोक्ष्यसे, महीम्,\n" +
                "तस्मात्, उत्तिष्ठ, कौन्तेय, युद्धाय, कृतनिश्चयः।।37।।","या तो तुम युद्ध में मरोगे और स्वर्ग को प्राप्त करोगे या युद्ध को जीतकर पृथ्वी के राज्य का भोग करोगे। इसलिए हे अर्जुन! दृढ़ निश्चय के साथ युद्ध के लिए खड़े हों।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 38","सुखदुःखे, समे, कृत्वा, लाभालाभौ, जयाजयौ,\n" +
                "ततः, युद्धाय, युज्यस्व, न, एवम्, पापम्, अवाप्स्यसि।।38।।","जय-पराजय, लाभ-हानि और सुख-दुख को समान समझकर युद्ध के लिए तैयार हो जाओ। इस प्रकार, आपको पाप नहीं लगेगा।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 39","एषा, ते, अभिहिता, साङ्ख्ये, बुद्धिः, योगे, तु, इमाम्, श्रृणु,\n" +
                "बुद्धया, युक्तः, यया, पार्थ, कर्मबन्धम्, प्रहास्यसि।।39।।","ओह पार्थ! यह ज्ञानयोग के सम्बन्ध में तुम्हें यह ज्ञानवाणी दी गई थी और अब तुम इसे योग के सम्बन्ध में सुनते हो; जिस ज्ञान से संपन्न होकर आप कर्मों के बंधन को पूरी तरह से त्याग देंगे अर्थात् उसे पूरी तरह से नष्ट कर देंगे। गीता अध्याय 6 श्लोक 46 में कहा है कि ज्ञानयोगियों तथा कर्मयोगियों की तुलना में तत्वदर्शी सन्त अर्थात् योगी श्रेष्ठ है। इसी गीता के अध्याय 5 के श्लोक 2 में शास्त्रविरुद्ध ज्ञानयोगी अर्थात् तपस्वी और कर्मयोगी दोनों को हीन कहा है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 40","न, इह, अभिक्रमनाशः, अस्ति, प्रत्यवायः, न, विद्यते,\n" +
                "स्वल्पम्, अपि, अस्य, धर्मस्य, त्रायते, महतः, भयात्।।40।।","इस योग में आदि अर्थात् बीज का नाश नहीं होता और फल रूपी दोष/पाप को भी नहीं जानते; बल्कि इस योग धर्म के भक्ति धन का एक अंश भी महाभय से रक्षा करता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 41","व्यवसायात्मिका, बुद्धिः, एका, इह, कुरुनन्दन,\n" +
                "बहुशाखाः, हि, अनन्ताः, च, बुद्धयः, अव्यवसायिनाम्।।41।।","हे अर्जुन! इस योग में दृढ़बुद्धि और ज्ञानवाणी एक ही होती है, परन्तु जो मनुष्य अनिर्वचनीय, विचारहीन और इच्छुक होते हैं, उनकी बुद्धि अर्थात् ज्ञान के दृष्टिकोण निश्चय ही अनेक भेदों से युक्त और असीमित होते हैं।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 42,43,44","याम्, इमाम्, पुष्पिताम्, वाचम्, प्रवदन्ति, अविपश्चितः,\n" +
                "वेदवादरताः, पार्थ, न, अन्यत्, अस्ति, इति, वादिनः।।42।।\n" +
                "\n" +
                "कामात्मानः, स्वर्गपराः, जन्मकर्मफलप्रदाम्,\n" +
                "क्रियाविशेषबहुलाम्, भोगैश्वर्यगतिम्, प्रति।।43।।\n" +
                "\n" +
                "भोगैश्वर्यप्रसक्तानाम्, तया, अपहृतचेतसाम्,\n" +
                "व्यवसायात्मिका, बुद्धिः, समाधौ, न, विधीयते।।44।।","हे अर्जुन! जो सांसारिक सुखों में मग्न हो रहे हैं, (जिन्हें) केवल वेदों के मन्त्रों में आसक्ति है, जिनके मन में स्वर्ग ही एकमात्र परम सिद्धि है और कुछ नहीं-ऐसा वे कहते हैं। इस प्रकार की अलंकारिक अर्थात् दिखावटी अलंकारिक वाणी जो वे अविवेकी लोग देते हैं, जो कर्मों के फल के रूप में जन्म लेते हैं और जो सांसारिक सुखों और विलासिता की प्राप्ति के लिए विभिन्न प्रकार के कर्मकांडों / गतिविधियों का वर्णन करते हैं; जिनका हृदय उस वाणी द्वारा हर लिया गया है, जो सांसारिक सुखों और विलासिता में दृढ़ता से तल्लीन हैं, उन पुरुषों का परमेश्वर की एकाग्रता में दृढ़ मन नहीं लगता है।"));

        list2.add(new GeetaModel("Adhya 2","Geeta Slok 45","त्रौगुण्यविषयाः, वेदाः, निस्त्रौगुण्यः, भव, अर्जुन,\n" +
                "निद्र्वन्द्वः, नित्यसत्त्वस्थः, निर्योगक्षेमः, आत्मवान्।।45।।","हे अर्जुन! रजगुण-ब्रह्मा, सतगुण-विष्णु और तमगुण-शिव तीनों गुणों से प्राप्त सांसारिक सुखों के ज्ञान से, तीनों गुणों से ऊपर उठकर, सुख-दुःख की उलझनों से मुक्त, सनातन वस्तु में स्थित सत्यपुरुष अर्थात् पूर्ण परमात्मा योग क्षेम अर्थात् भक्ति के बदले सांसारिक सुखों की इच्छा न रखते हुए स्वयं में आस्तिक बनो।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 46","यावान्, अर्थः, उदपाने, सर्वतः, सम्प्लुतोदके,\n" +
                "तावान्, सर्वेषु, वेदेषु, ब्राह्मणस्य, विजानतः।।46।।","पूरी तरह लबालब भरे जलाशय को प्राप्त करने के बाद एक छोटे से जलाशय में जो रुचि बची है, एक विद्वान व्यक्ति, जो परमेश्वर को तत्व से जानता है, के पास सभी ज्ञानों में उतनी ही रुचि बची है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 47","कर्मणि, एव, अधिकारः, ते, मा, फलेषु, कदाचन,\n" +
                "मा, कर्मफलहेतुः, भूः, मा, ते, संगः, अस्तु, अकर्मणि।।47।।","अध्याय 2 श्लोक 47\n" +
                "कर्माणि, एव, अधिकारः, ते, मा, फलेषु, कदाचन,\n" +
                "मा, कर्मफलहेतुः, भूः, मा, ते, संगः, अस्तु, अकर्मणि ||47||\n" +
                "\n" +
                "अनुवाद: (ते) तुम्हारा (कर्मिणी) कर्म करनेमें (एव) ही (अधिकारः) अधिकार है (फलेषु) फलोंमें (कदाचन) बिल्कुल भी नहीं (मा) नहीं; इसलिए आप (कर्मफलहेतुः) कर्मों के फलों के उद्देश्य से (मा, भोः) नहीं होते; और (ते) तुम्हारा (अकर्मणि) कर्म न करना भी (संगः) आसक्ति (मा) न (अस्तु) हो। (47)\n" +
                "\n" +
                "अनुवाद\n" +
                "आपको केवल कर्म करने का अधिकार है उसके फल का कभी नहीं। अतः आप कर्मफल के कारण नहीं हो और कर्म न करने में भी आसक्ति नहीं रखनी चाहिए।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 48","योगस्थः, कुरु, कर्माणि, संगम्, त्यक्त्वा, धन×जय,\n" +
                "सिद्धयसिद्धयोः, समः, भूत्वा, समत्वम्, योगः, उच्यते।।48।।","हे धनंजय! आसक्ति को त्याग कर सफलता और असफलता में संतुलित होकर, शास्त्रों के अनुसार भक्ति-योग में स्थापित होकर, शास्त्रों के आदेश के अनुसार भक्ति के अनिवार्य कार्यों को करो; समचित्तता ही योग अर्थात् सच्ची भक्ति कहलाती है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 49","दूरेण, हि, अवरम्, कर्म, बुद्धियोगात्, धनजय,\n" +
                "बुद्धौ, शरणम्, अन्विच्छ, कृपणाः, फलहेतवः।।49।।","भक्ति मार्ग का आत्मनिर्णित निष्कर्ष अर्थात् मनमाना व्यवहार अर्थात अपने मन से भक्ति का कार्य बहुत निम्न स्तर का है। इसलिए हे धनंजय! एक पूर्ण परमात्मा का ज्ञान कराने वाले संत की शरण लेनी चाहिए अर्थात् तत्वदर्शी संतों द्वारा बताए गए एक ही पूर्ण परमात्मा के भक्ति मार्ग का आश्रय लेना चाहिए क्योंकि सबसे दयनीय वे हैं जो फल/परिणाम के कारण बनते हैं।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 50","बुद्धियुक्तः, जहाति, इह, उभे, सुकृतदुष्कृते,\n" +
                "तस्मात् योगाय, युज्यस्व, योगः, कर्मसु, कौशलम्।।50।।","मन की समता से युक्त अर्थात् तत्वदर्शी संत द्वारा निर्देशित सच्चे शास्त्रानुकूल भक्ति मार्ग में लीन भक्त इन दोनों अच्छे कर्मों को त्याग देता है, जैसे मनमाना धार्मिक अभ्यास जो वह शुभ या अनुसार कर रहा था मेरे द्वारा बताया गया मार्ग - 'ओम' का जाप और यज्ञ आदि, वह जो पुण्य कर्म करता था, और पाप कर्म - मांस-शराब-तंबाकू आदि नशीले पदार्थों का सेवन करना, इसी लोक अर्थात् काल लोक में अर्थात् वह पूर्ण संत के निर्देशानुसार कार्य करता है। इसलिए आप शास्त्रानुकूल साधना अर्थात् सच्ची भक्ति में लग जाओ। भक्ति के कार्यों में से केवल तत्वदर्शी संत द्वारा निर्देशित भक्ति मार्ग ही कल्याणकारी है अर्थात् एक बुद्धिमान कार्य है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 51","कर्मजम्, बुद्धियुक्ताः, हि, फलम्, त्यक्त्वा, मनीषिणः,\n" +
                "जन्मबन्धविनिर्मुक्ताः, पदम्, गच्छन्ति, अनामयम्।।51।।","क्योंकि तत्वज्ञान के आधार पर समचित्त, लीन मनुष्य कर्मों के फल को त्यागकर जन्म-बन्धन से पूर्णत: मुक्त होकर अनामी अर्थात् जन्म-मरण के रोग से मुक्त परमपद अर्थात् सतलोक में जाते हैं। अर्थात उन्हें पूर्ण मोक्ष की प्राप्ति होती है अर्थात जन्म-मरण का रोग पूर्णतया समाप्त हो जाता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 52","यदा, ते, मोहकलिलम्, बुद्धिः, व्यतितरिष्यति,\n" +
                "तदा, गन्तासि, निर्वेदम्, श्रोतव्यस्य, श्रुतस्य, च।।52।।","जिस समय आपकी बुद्धि मोह अर्थात् अज्ञान के कीचड़ से पूरी तरह पार हो जायेगी, अर्थात् जब आप तत्वज्ञान (सच्चे आध्यात्मिक ज्ञान) से अवगत हो जायेंगे, तब आपको सभी भोगों से संबंधित सुनी-सुनाई लोककथाएँ मिलेंगी इस लोक को और (परलोक) दूसरे लोक अर्थात् स्वर्ग और महास्वर्ग को वेदविरुद्ध ज्ञान अर्थात् अज्ञेय वाद-विवाद के रूप में व्यर्थ होना।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 53","श्रुतिविप्रतिपन्ना, ते, यदा, स्थास्यति, निश्चला,\n" +
                "समाधौ, अचला, बुद्धिः, तदा, योगम्, अवाप्स्यसि।।53।।","तरह-तरह की बातें सुनकर भ्रमित होकर जब आपकी बुद्धि तत्वज्ञान के आधार पर स्थिर होकर एक ईश्वर के चिन्तन में दृढ़ हो जायेगी तब आपको योग अर्थात् भक्ति की प्राप्ति होगी। तब तुम्हारी भक्ति प्रारम्भ होगी अर्थात् तब तुम योगी बनोगे। गीता अध्याय 6 श्लोक 46 में कहा है कि हे अर्जुन तू योगी बन।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 54","स्थितप्रज्ञस्य, का, भाषा, समाधिस्थस्य, केशव,\n" +
                "स्थितधीः, किम्, प्रभाषेत, किम्, आसीत, व्रजेत, किम्।।54।।","हे केशव ! स्थिर बुद्धि वाले, सहज समाधि में स्थित, परमात्मा को प्राप्त करने वाले की परिभाषा अर्थात् लक्षण क्या है? वह स्थिर मन वाला कैसे बोलता है? वह कैसे बैठता है और कैसे चलता है?"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 55","प्रजहाति, यदा, कामान्, सर्वान्, पार्थ, मनोगतान्\n" +
                "आत्मनि, एव, आत्मना, तुष्टः, स्थितप्रज्ञः, तदा, उच्यते।।55।।","हे अर्जुन! जब यह व्यक्ति मन में मौजूद सभी इच्छाओं को पूरी तरह से त्याग देता है और आत्मा से अर्थात् समर्पण के साथ आत्मा के साथ रहने वाले भगवान में ही संतुष्ट रहता है, तो उसे स्थिर मन वाला कहा जाता है यानी वह नहीं बनता है भ्रमित और केवल तत्वदर्शी संत के सच्चे आध्यात्मिक ज्ञान पर पूरी तरह से आधारित रहता है। वह एक योगी हैं।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 56","दुःखेषु, अनुद्विग्नमनाः, सुखेषु, विगतस्पृहः,\n" +
                "वीतरागभयक्रोधः, स्थितधीः, मुनिः, उच्यते।।56।।","जिसका मन दु:खों की प्राप्ति से उद्विग्न रहता है, जो सुखों की प्राप्ति पर सदा कामनाओं से मुक्त रहता है और जिसका राग, भय और क्रोध नष्ट हो गया है, वह मुनि अर्थात् उपासक स्थिर मन वाला कहा जाता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 57","\n" +
                "यः, सर्वत्रा, अनभिस्नेहः, तत्, तत्, प्राप्य, शुभाशुभम्,\n" +
                "न, अभिनन्दति, न, द्वेष्टि, तस्य, प्रज्ञा, प्रतिष्ठिता।।57।।","जो सब ओर से ममता रहित होकर उस अच्छी-बुरी वस्तु को प्राप्त करके न हर्षित होता है और न द्वेष करता है, उसका मन स्थिर है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 58","यदा, संहरते, च, अयम्, कूर्मः, अंगानि, इव, सर्वशः,\n" +
                "इन्द्रियाणि, इन्द्रियार्थेभ्यः, तस्य, प्रज्ञा, प्रतिष्ठिता।।58।।","और जिस प्रकार कछुआ अपने अंगों को चारों ओर से समेट लेता है; इसी प्रकार जब यह व्यक्ति सब प्रकार से इन्द्रियविषयों से इन्द्रियों को हटा लेता है, तब मनुष्य को समझना चाहिए कि उसका मन स्थिर है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 59","विषयाः, विनिवर्तन्ते, निराहारस्य, देहिनः,\n" +
                "रसवर्जम्, रसः, अपि, अस्य, परम्, दृष्टवा, निवर्तते।।59।।","जो मनुष्य इन्द्रियों से विषयों का भोग नहीं करता, उसके दोष ही समाप्त हो जाते हैं, पर आसक्ति नहीं छूटती। इस स्थिर मन वाले, श्रेष्ठ देखने वाले अर्थात् इन दोषों से होने वाले नुकसान को जानने वाले व्यक्ति की आसक्ति भी समाप्त हो जाती है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 60","यततः, हि, अपि, कौन्तेय, पुरुषस्य, विपिश्चितः,\n" +
                "इन्द्रियाणि, प्रमाथीनि, हरन्ति, प्रसभम्, मनः।।60।।","हे अर्जुन! क्योंकि ये अशांत इन्द्रियाँ प्रयत्नशील ज्ञानी पुरुष के मन को भी बलपूर्वक मोहित कर लेती हैं।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 61","तानि, सर्वाणि, संयम्य, युक्तः, आसीत, मत्परः,\n" +
                "वशे, हि, यस्य, इन्द्रियाणि, तस्य, प्रज्ञा, प्रतिष्ठिता।।61।।","उन सब इन्द्रियों को वश में करके मन को वश में करके निश्चयपूर्वक शास्त्रानुकूल साधना में लग जाओ क्योंकि जिसकी इन्द्रियाँ वश में हैं उसकी बुद्धि स्थिर हो जाती है अर्थात् मन और इन्द्रियों पर बुद्धि का आधिपत्य हो जाता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 62","ध्यायतः, विषयान्, पुंसः, संग, तेषु, उपजायते, संगात्,\n" +
                "सजायते, कामः, कामात्, क्रोधः, अभिजायते।। 62।।","जो सांसारिक भोगों पर विचार करता है, वह उन सांसारिक भोगों के प्रति आसक्त हो जाता है। आसक्ति से उन सांसारिक भोगों की इच्छा उत्पन्न होती है और इच्छाओं की पूर्ति में बाधा से क्रोध उत्पन्न होता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 63","क्रोधात्, भवति, सम्मोहः, सम्मोहात्, स्मृतिविभ्रमः,\n" +
                "स्मृतिभ्रंशात्, बुद्धिनाशः, बुद्धिनाशात्, प्रणश्यति।।63।।","क्रोध से निरी मूर्खता उत्पन्न होती है; मूर्खता स्मृति में भ्रम की ओर ले जाती है; स्मृति में भ्रम होने से बुद्धि अर्थात् ज्ञान की शक्ति का नाश होता है और बुद्धि के नाश होने पर यह मनुष्य अपनी अवस्था से गिर जाता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 64","रागद्वेषवियुक्तैः, तु, विषयान्, इन्द्रियैः, चरन्,\n" +
                "आत्मवश्यैः, विधेयात्मा, प्रसादम्, अधिगच्छति।।64।।","परन्तु भक्त जिसका अंतःकरण तत्वज्ञान द्वारा वश में कर लिया गया है, अपनी इन्द्रियों को वश में करके, राग-द्वेष से रहित होकर भी इन्द्रियों के विषयों (सांसारिक भोगों) में भटकता हुआ भी उनमें लिप्त नहीं होता और सुख प्राप्त करता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 65","प्रसादे, सर्वदुःखानाम्, हानिः, अस्य, उपजायते,\n" +
                "प्रसन्नचेतसः, हि, आशु, बुद्धिः, पर्यवतिष्ठते।।65।।","आन्तरिक सुख की प्राप्ति पर उसके सारे दु:ख समाप्त हो जाते हैं और उस कर्मयोगी का मन प्रसन्नचित्त होकर शीघ्र ही सब ओर से हटकर एक ही परमात्मा में दृढ़ हो जाता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 66","न, अस्ति, बुद्धिः, अयुक्तस्य, न, च, अयुक्तस्य, भावना,\n" +
                "न, च, अभावयतः, शान्तिः, अशान्तस्य, कुतः, सुखम्।।66।।","जिस मनुष्य ने अपने मन और इन्द्रियों को वश में नहीं किया है, उसकी बुद्धि दृढ़ नहीं होती है और अनियंत्रित मन वाले व्यक्ति के अंतःकरण में कोई भावना नहीं होती है। और भावहीन व्यक्ति को शांति प्राप्त नहीं होती। शांति से रहित व्यक्ति सुख कैसे प्राप्त कर सकता है?"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 67","इन्द्रियाणाम्, हि, चरताम्, यत्, मनः, अनु, विधीयते,\n" +
                "तत्, अस्य, हरति, प्रज्ञाम्, वायुः, नावम्, इव, अम्भसि।।67।।","क्योंकि जैसे जल में चलती हुई नाव को वायु उड़ा ले जाती है; इसी प्रकार जब मन इन्द्रिय-विषयों में विचरती हुई इन्द्रियों के बीच किसी इन्द्रिय के अधूरे ज्ञान पर आधारित हो जाता है, तो निरंकुश मन वाले मनुष्य की बुद्धि बह जाती है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 68","तस्मात् यस्य, महाबाहो, निगृहीतानि, सर्वशः,\n" +
                "इन्द्रियाणि, इन्द्रियार्थेभ्यः, तस्य, प्रज्ञा, प्रतिष्ठिता।।68।।","इसलिए हे महाबाहो! जिसकी इन्द्रियाँ तत्वज्ञान के आधार पर सब प्रकार से इन्द्रियविषयों से निरुद्ध हो गई हैं, केवल उसी का मन स्थिर है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 69","या, निशा, सर्वभूतानाम्, तस्याम्, जागर्ति, संयमी,\n" +
                "यस्याम्, जाग्रति, भूतानि, सा, निशा, पश्यतः, मुनेः।।69।।","समस्त प्राणियों के लिए जो रात्रि के समान है, उस सनातन ज्ञान रूपी परम सुख दाता परमात्मा की प्राप्ति में स्थिर मन वाला योगी जाग्रत रहता है। सभी जीव अल्पकाल के सांसारिक सुखों की प्राप्ति के लिए जागते रहते हैं और उस मुनि के लिए जो परमात्मा के सत्य को जानता है वह रात्रि के समान है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 70","आपूर्यमाणम्, अचलप्रतिष्ठम्, समुद्रम्, आपः, प्रविशन्ति, यद्वत्,\n" +
                "तद्वत्, कामाः, यम्, प्रविशन्ति, सर्वे, सः, शान्तिम्, आप्नोति, न, कामकामी।।70।।","जिस प्रकार विभिन्न नदियों का जल समुद्र में प्रवेश करता है, जो चारों ओर से भरा हुआ है और बिना विचलित हुए स्थिर स्थिति में है; इसी तरह स्थिर मन वाले व्यक्ति में बिना किसी दोष के सभी इच्छाएं विलीन हो जाती हैं। केवल वही मनुष्य परमशान्ति को प्राप्त होता है, न कि इच्छाओं की पूर्ति के लिए प्रयत्न करने वाला।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 71","विहाय, कामान्, यः, सर्वान्, पुमान्, चरति, निःस्पृहः,\n" +
                "निर्ममः, निरहंकारः, सः, शान्तिम्, अधिगच्छति।।71।।","जो मनुष्य समस्त कामनाओं को त्याग कर मालकियत, अहंकार और उत्कंठा से मुक्त होकर विचरता है, वही शान्ति को प्राप्त होता है।"));
        list2.add(new GeetaModel("Adhya 2","Geeta Slok 72","एषा, ब्राह्मी, स्थितिः, पार्थ, न, एनाम्, प्राप्य, विमुह्यति,\n" +
                "स्थित्वा, अस्याम्, अन्तकाले, अपि, ब्रह्मनिर्वाणम्, ऋच्छति।।72।।","हे अर्जुन! इच्छाओं के त्याग की यह उपर्युक्त स्थिति, अहंकार से मुक्त, एक भक्त की स्थिति है जिसने भगवान को प्राप्त कर लिया है। इसे प्राप्त न करने से साधक विषयों/सांसारिक भोगों के प्रति आकर्षित हो जाता है और मृत्यु के समय जिसके दोष समाप्त नहीं हुए हैं, वह इस स्थिति में स्थित होने पर भी परमेश्वर को प्राप्त करने की क्षमता खो देता है अर्थात लाभ से वंचित रह जाता है परमपिता परमेश्वर को प्राप्त करने के लिए।"));
//        list2.add(new GeetaModel("Adhya 2","Geeta Slok 63","",""));

    }
}